[
  {
    "id": 0,
    "title": "The Fall",
    "description": "What happened...?",
    "background": "/images/backgrounds/mountainshackbg.png",
    "characters": [{ "id": "Droplet", "position": "right" }],
    "dialogues": [
      {
        "speakerId": "Narrator",
        "expression": "neutral",
        "text": "Memories flash through your mind. Mountain peak, power, ascension.",
        "background": "/images/backgrounds/ascensionbg.png"
      },
      {
        "speakerId": "Narrator",
        "expression": "neutral",
        "text": "Something went wrong. Falling, darkness, pain.",
        "background": "/images/backgrounds/fallingbg.png"
      },
      {
        "speakerId": "Mysterious Voice",
        "expression": "neutral",
        "text": "You're finally awake! I've been waiting for you. You need to rebuild your strength. Go to the cultivation page and upgrade you base cultivation rate. This will help you. in the next step. It will help you see me better too."
      },
      {
        "speakerId": "Droplet",
        "expression": "happy",
        "text": "well done! now you can see me better. Something went wrong on the peak. You need to find out what happened. before we head out you need a spirit to protect yourself. Go to the summon page and summon your first spirit and then go to spirit page to assign them to your active party!"
      },
      {
        "speakerId": "Droplet",
        "expression": "happy",
        "text": "We'll have to keep cultivating and summoning spirits to get stronger. Lets head out for now and start our journey!"
      }
    ],
    "encounterId": "e001"
  },
  {
    "id": 1,
    "title": "First Steps",
    "description": "Learn the basics of Qi cultivation",
    "characters": [{ "id": "Droplet", "position": "right" }],
    "dialogues": [
      {
        "speakerId": "Droplet",
        "expression": "happy",
        "text": "How was your first fight? lets level up our spirit. Go to the spirit page, click your spirit and level up! You can get more spirit essense later by summoning more spirits and harmonizing them."
      },
      {
        "speakerId": "Droplet",
        "expression": "happy",
        "text": "The more battles you do the more Qi and Qi generation you will get! make sure to keep upgrading that Qi generation rate! Head on to the battle tab to start training"
      },
      {
        "speakerId": "Droplet",
        "expression": "angry",
        "text": "there seems to be a corrupted spirit up ahead. It's level 10 so get your spirits prepared and take it on!"
      }
    ],
    "encounterId": "e_boss_01"
  }
]
