[
  {
    "id": 0,
    "title": "The Awakening",
    "description": "You open your eyes to find yourself in a mystical realm...",
    "dialogues": [
      {
        "speaker": "Narrator",
        "text": "You open your eyes to find yourself in a mystical realm shrouded in ethereal mist."
      },
      {
        "speaker": "Narrator",
        "text": "The air tingles with spiritual energy - Qi flows through everything around you like invisible rivers of power."
      },
      {
        "speaker": "Mysterious Voice",
        "text": "Ah, another soul awakens to the path of cultivation. Welcome, young one."
      },
      {
        "speaker": "Narrator",
        "text": "A figure materializes before you, draped in flowing robes that shimmer with ancient runes."
      },
      {
        "speaker": "Elder Chen",
        "text": "I am Elder Chen, guardian of this realm. Your journey to immortality begins now. First, you must learn to sense and gather Qi."
      }
    ],
    "encounterId": "e001"
  },
  {
    "id": 1,
    "title": "First Cultivation",
    "description": "Learn the basics of Qi cultivation",
    "dialogues": [
      {
        "speaker": "Elder Chen",
        "text": "Close your eyes and feel the flow of Qi around you. It moves like water, yet burns like fire."
      },
      {
        "speaker": "Narrator",
        "text": "You follow the Elder's guidance, feeling a warm sensation building in your core."
      },
      {
        "speaker": "Elder Chen",
        "text": "Good! You have a natural affinity. Now, direct that energy through your meridians."
      },
      {
        "speaker": "Narrator",
        "text": "As you practice, the Qi flows more easily. You can feel yourself growing stronger with each breath."
      }
    ],
    "encounterId": "e001"
  },
  {
    "id": 2,
    "title": "Spirit Bonding",
    "description": "Form your first bond with a spirit companion",
    "dialogues": [
      {
        "speaker": "Elder Chen",
        "text": "Cultivators do not walk the path alone. Spirit companions will aid you on your journey."
      },
      {
        "speaker": "Narrator",
        "text": "The Elder gestures toward a glowing summoning circle etched into the ancient stones."
      },
      {
        "speaker": "Elder Chen",
        "text": "Use your Qi to call forth a spirit. They will sense your essence and those who resonate with you will answer."
      },
      {
        "speaker": "Narrator",
        "text": "You channel your energy into the circle. It flares with brilliant light!"
      },
      {
        "speaker": "Narrator",
        "text": "When the light fades, a magnificent spirit stands before you, ready to join your journey."
      }
    ],
    "encounterId": null
  },
  {
    "id": 3,
    "title": "The Trial",
    "description": "Face your first challenge",
    "dialogues": [
      {
        "speaker": "Elder Chen",
        "text": "You have learned well, but knowledge without practice is worthless. You must face the Trial of Initiation."
      },
      {
        "speaker": "Narrator",
        "text": "The Elder leads you to a massive stone arena, its walls covered in the names of countless cultivators who came before."
      },
      {
        "speaker": "Elder Chen",
        "text": "Within this arena, you will face manifestations of spiritual energy. Work with your spirit companion to overcome them."
      },
      {
        "speaker": "Narrator",
        "text": "A rift tears open in the center of the arena. Dark energy begins to coalesce into a threatening form."
      },
      {
        "speaker": "Elder Chen",
        "text": "Remember your training. Trust in your spirits, and victory shall be yours. Begin!"
      }
    ],
    "encounterId": "e002"
  },
  {
    "id": 4,
    "title": "Ancient Wisdom",
    "description": "Discover the secrets of the five elements",
    "dialogues": [
      {
        "speaker": "Elder Chen",
        "text": "You have proven yourself worthy. Now I shall teach you of the Five Elements that govern all cultivation."
      },
      {
        "speaker": "Narrator",
        "text": "The Elder summons five orbs of energy, each pulsing with different colored light."
      },
      {
        "speaker": "Elder Chen",
        "text": "Wood feeds Fire, Fire creates Earth, Earth bears Metal, Metal collects Water, and Water nourishes Wood."
      },
      {
        "speaker": "Elder Chen",
        "text": "But remember - Wood also parts Earth, Earth dams Water, Water quenches Fire, Fire melts Metal, and Metal chops Wood."
      }
    ],
    "encounterId": null
  }
]
